tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Modern replacement for 'ls'
brew "exa"
# Fast and simple Node.js version manager
brew "fnm"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Fulltext search engine and column store
brew "groonga"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# File browser
brew "ranger"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
cask "font-hack-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Open-source code editor
cask "visual-studio-code"
mas "Bitwarden", id: 1352778147
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft OneNote", id: 784801555
mas "WavePad Audio Editor", id: 970044455
